#include <stdio.h>
//const int  a = 8848;//放在了常量区
int main11 ()
{
	/*const作用：修饰一个变量使之变成常量 

	 要求：必须初始化 

	 const 修饰指针变量：
	1：指针变量不可指向新地址
	2：指针变量指向的地址数据不可修改
	*/

	const int  a = 8848 ;//局部变量空间——放在栈区的
	/*a = 8848;//直接访问 不可修改
	a = 8898;
	a++;*/
	const int * p = &a;//常量指针
//	*p = 8898;// 

	//标准的指针模型
	//int m = 3, n=4;
	//int* q = &m;
	//*q = 5;//间接访问空间
	//q = &n;//改变指向
	//*q = 8;

	//------指向可改 内容不可改------------//
	//int m = 3, n=4;
	//const int  * q = &m;
	//*q = 5;//间接访问空间
	//q = &n;//改变指向
	//*q = 8;


	//----------指向不可改 内容可改---------------//
	//int m = 3, n=4;
	//int* const  q = &m;
	//*q = 5;//间接访问空间
	//q = &n;//改变指向
	//*q = 8;
	
	
	//----------指向不可改 内容不可改---------------//
	//int m = 3, n=4;
	//int const* const q = &m;
	//*q = 5;//间接访问空间
	//q = &n;//改变指向
	//*q = 8;
	
	
	//--结论：const放到谁的前面，谁就不可改---------------//


	return 0;
}