#include <stdio.h>
int main01 ()
{
	int as[]={10,20,30,40,50};
	/*1 数组名的真正作用：数组整个存储空间的首地址,也代表第0个元素的地址*/
	printf("%d %d %d\n",as,as+1,as+2);//找到·地址
		/*2 数组名+偏移量操作成员空间*/
	printf("%d %d %d\n",*(as+0) ,*(as+1),*(as+2));	//得到·空间
	printf("%d %d %d\n",  as[0], as[1],  as[2]);//

	printf("%d %d %d\n", &as[0], &as[1], &as[2]);
 	/*3 深度理解[] 作为运算符的作用：就是指针移动*/
	// 参考地址 [ 偏移 ]  等价  *(参考地址+偏移)
	// as[2]  拆 *(as + 2)
	// 2[as] 拆  *(2 + as)
	printf("%d %d\n", as[2],2[as]);

	printf("%d\n", (as+2)[2]);// (as+2)[2] 拆  *（as+2+  2）
	return 0; 
}