#include <stdio.h>
int main02 ()
{
	int as[]={10,20,30,40,50};
	int *p;
	/*1  int型指针 指向int型数组 的意义：增加遍历的手段*/
	p = as;//&as[0]  p指向第0个成员空间
	p[1] *(p+1)
	/*2 比较 指针+1与数组名+1的区别 */
	/*printf("%d %d\n",as+1,p+1);
	printf("%d %d\n", *(as + 1),*( p + 1));*/
	//p++;//p是指针变量，指向可被修改
	//printf("%d\n",*p);
	//as++;//数组名是找到数组空间的唯一依据，数组名不可被修改，数组名是个指针常量
	/*3 深度理解： 
	数组名+[下标] 与 *(指针+移动) 与 指针+[下标] 的应用效果*/
	//固定地址方式  遍历数组
	for (int i=0 ;i<5 ;i++ )
	{
		printf("%d %d %d %d\n",as[i], *(as + i ), *(p+i), p[i] );
	}
	/*4 利用指针变量实现数组的遍历操作*/
	for (int i = 0;i < 5;i++)
	{
		/*printf("%d\n",*p);
		p++;*/
		printf("%d\n", *p++);
		 
	}

	return 0;
}